ghsecuritylab/tysdk_for_bk7231/beken378/ip/mac/mac_frame.h
/// HT CAPABILITY INFORMATION FIELD
#define MAC_HTCAPA_LDPC                 CO_BIT(0)
#define MAC_HTCAPA_40_MHZ               CO_BIT(1)
#define MAC_HTCAPA_SMPS_OFT             2
#define MAC_HTCAPA_SMPS_MSK             (0x03 << MAC_HTCAPA_SMPS_OFT)
#define MAC_HTCAPA_SMPS_STATIC          (0x00 << MAC_HTCAPA_SMPS_OFT)
#define MAC_HTCAPA_SMPS_DYNAMIC         (0x01 << MAC_HTCAPA_SMPS_OFT)
#define MAC_HTCAPA_SMPS_DISABLE         (0x03 << MAC_HTCAPA_SMPS_OFT)
#define MAC_HTCAPA_SHORTGI_20           CO_BIT(5)
#define MAC_HTCAPA_SHORTGI_40           CO_BIT(6)
#define MAC_HTCAPA_TX_STBC              CO_BIT(7)
#define MAC_HTCAPA_RX_STBC_OFT          8
#define MAC_HTCAPA_RX_STBC_MSK          (0x03 << MAC_HTCAPA_RX_STBC_OFT)
#define MAC_HTCAPA_AMSDU                CO_BIT(11)
#define MAC_HTCAPA_DSSS_CCK_40          CO_BIT(12)
#define MAC_HTCAPA_40_INTOLERANT        CO_BIT(14)
#define MAC_HTCAPA_LSIG                 CO_BIT(15)

/// HT A-MPDU PARAMETERS INFORMATION FIELD
#define MAC_AMPDU_LEN_EXP_OFT           0
#define MAC_AMPDU_LEN_EXP_MSK           (0x03 << MAC_AMPDU_LEN_EXP_OFT)
#define MAC_AMPDU_MIN_SPACING_OFT       2
#define MAC_AMPDU_MIN_SPACING_MSK       (0x07 << MAC_AMPDU_MIN_SPACING_OFT)

#define MAC_HT_MAX_AMPDU_FACTOR         13

/// HT EXTENDED CAPABILITY
#define MAC_HTXCAPA_MFB_UNSOLICIT       CO_BIT(9)


// VHT CAPABILITIES
#define MAC_VHTCAPA_MAX_MPDU_LENGTH_OFT        0
#define MAC_VHTCAPA_MAX_MPDU_LENGTH_MSK        (0x03 << MAC_VHTCAPA_MAX_MPDU_LENGTH_OFT)
#define MAC_VHTCAPA_MAX_MPDU_LENGTH_3895       (0x00 << MAC_VHTCAPA_MAX_MPDU_LENGTH_OFT)
#define MAC_VHTCAPA_MAX_MPDU_LENGTH_7991       (0x01 << MAC_VHTCAPA_MAX_MPDU_LENGTH_OFT)
#define MAC_VHTCAPA_MAX_MPDU_LENGTH_11454      (0x02 << MAC_VHTCAPA_MAX_MPDU_LENGTH_OFT)
#define MAC_VHTCAPA_SUPP_CHAN_WIDTH_160MHZ     CO_BIT(2)
#define MAC_VHTCAPA_SUPP_CHAN_WIDTH_160_80P80  CO_BIT(3)
#define MAC_VHTCAPA_SUPP_CHAN_WIDTH_OFT        2
#define MAC_VHTCAPA_SUPP_CHAN_WIDTH_MSK        (0x03 << MAC_VHTCAPA_SUPP_CHAN_WIDTH_OFT)
#define MAC_VHTCAPA_RXLDPC                     CO_BIT(4)
#define MAC_VHTCAPA_SHORT_GI_80                CO_BIT(5)
#define MAC_VHTCAPA_SHORT_GI_160               CO_BIT(6)
#define MAC_VHTCAPA_TXSTBC                     CO_BIT(7)
#define MAC_VHTCAPA_RXSTBC_OFT                 8
#define MAC_VHTCAPA_RXSTBC_MSK                 (0x07 << MAC_VHTCAPA_RXSTBC_OFT)
#define MAC_VHTCAPA_RXSTBC_1                   (0x01 << MAC_VHTCAPA_RXSTBC_OFT)
#define MAC_VHTCAPA_RXSTBC_2                   (0x02 << MAC_VHTCAPA_RXSTBC_OFT)
#define MAC_VHTCAPA_RXSTBC_3                   (0x03 << MAC_VHTCAPA_RXSTBC_OFT)
#define MAC_VHTCAPA_RXSTBC_4                   (0x04 << MAC_VHTCAPA_RXSTBC_OFT)
#define MAC_VHTCAPA_SU_BEAMFORMER_CAPABLE      CO_BIT(11)
#define MAC_VHTCAPA_SU_BEAMFORMEE_CAPABLE      CO_BIT(12)
#define MAC_VHTCAPA_BEAMFORMEE_STS_OFT         13
#define MAC_VHTCAPA_BEAMFORMEE_STS_MSK         (0x07 << MAC_VHTCAPA_BEAMFORMEE_STS_OFT)
#define MAC_VHTCAPA_SOUNDING_DIMENSIONS_OFT    16
#define MAC_VHTCAPA_SOUNDING_DIMENSIONS_MSK    (0x07 << MAC_VHTCAPA_SOUNDING_DIMENSIONS_OFT)
#define MAC_VHTCAPA_MU_BEAMFORMER_CAPABLE      CO_BIT(19)
#define MAC_VHTCAPA_MU_BEAMFORMEE_CAPABLE      CO_BIT(20)
#define MAC_VHTCAPA_VHT_TXOP_PS                CO_BIT(21)
#define MAC_VHTCAPA_HTC_VHT                    CO_BIT(22)
#define MAC_VHTCAPA_MAX_A_MPDU_LENGTH_EXP_OFT  23
#define MAC_VHTCAPA_MAX_A_MPDU_LENGTH_EXP_MSK  (0x07 << MAC_VHTCAPA_MAX_A_MPDU_LENGTH_EXP_OFT)
#define MAC_VHTCAPA_VHT_LA_VHT_UNSOL_MFB       0x08000000
#define MAC_VHTCAPA_VHT_LA_VHT_MRQ_MFB         0x0c000000
#define MAC_VHTCAPA_RX_ANTENNA_PATTERN         CO_BIT(28)
#define MAC_VHTCAPA_TX_ANTENNA_PATTERN         CO_BIT(29)

#define MAC_VHT_MCS_MAP_MSK                    0x03
#define MAC_VHT_MCS_MAP_0_7                    0x00
#define MAC_VHT_MCS_MAP_0_8                    0x01
#define MAC_VHT_MCS_MAP_0_9                    0x02
#define MAC_VHT_MCS_MAP_NONE                   0x03


/****************************************************************************************
 * MAC FRAME OFFSETS
 ****************************************************************************************
 */
// Offset for the length frame in any element ID
#define MAC_LEN_OFT                             1

// SSID FIELD
#define MAC_SSID_ID_OFT                         0
#define MAC_SSID_LEN_OFT                        1
#define MAC_SSID_SSID_OFT                       2

// SUPPORTED RATES FIELD
#define MAC_RATES_ID_OFT                        0
#define MAC_RATES_LEN_OFT                       1
#define MAC_RATES_RATES_OFT                     2
#define MAC_RATES_LEN                           8

// FH PARAM SET FIELD
#define MAC_FH_ID_OFT                           0
#define MAC_FH_LEN_OFT                          1
#define MAC_FH_DWELL_OFT                        2
#define MAC_FH_HOP_SET_OFT                      4
#define MAC_FH_HOP_PAT_OFT                      5
#define MAC_FH_HOP_IDX_OFT                      6
#define MAC_FH_PARAM_LEN                        7

// DS PARAM SET
#define MAC_DS_ID_OFT                           0
#define MAC_DS_LEN_OFT                          1
#define MAC_DS_CHANNEL_OFT                      2
#define MAC_DS_PARAM_LEN                        3

// CF PARAM SET
#define MAC_CF_ID_OFT                           0
#define MAC_CF_LEN_OFT                          1
#define MAC_CF_COUNT_OFT                        2
#define MAC_CF_PERIOD_OFT                       3
#define MAC_CF_MAX_DUR_OFT                      4
#define MAC_CF_REM_DUR_OFT                      6
#define MAC_CF_PARAM_LEN                        8

// TIM
#define MAC_TIM_ID_OFT                          0
#define MAC_TIM_LEN_OFT                         1
#define MAC_TIM_CNT_OFT                         2
#define MAC_TIM_PERIOD_OFT                      3
#define MAC_TIM_BMPC_OFT                        4
#define MAC_TIM_BMP_OFT                         5
#define MAC_TIM_IE_LEN                         (5 + MAC_TIM_SIZE)
#define MAC_TIM_BCMC_PRESENT                    CO_BIT(0)

// IBSS PARAM SET
#define MAC_IBSS_ID_OFT                         0
#define MAC_IBSS_LEN_OFT                        1
#define MAC_IBSSATIM_OFT                        2
#define MAC_IBSS_PARAM_LEN                      4

// Country
#define MAC_COUNTRY_ID_OFT                      0
#define MAC_COUNTRY_LEN_OFT                     1
#define MAC_COUNTRY_STRING_OFT                  2
#define MAC_COUNTRY_STRING_LEN                  3
#define MAC_COUNTRY_FIRST_CHAN_OFT              0
#define MAC_COUNTRY_NB_CHAN_OFT                 1
#define MAC_COUNTRY_PWR_LEVEL_OFT               2
#define MAC_COUNTRY_TRIPLET_LEN                 3

// CHALLENGE PARAM SET
#define MAC_CHALLENGE_ID_OFT                    0
#define MAC_CHALLENGE_LEN_OFT                   1
#define MAC_CHALLENGE_TEXT_OFT                  2

// ERP
#define MAC_ERP_ID_OFT                          0
#define MAC_ERP_LEN_OFT                         1
#define MAC_ERP_PARAM_OFT                       2
// ERP BIT FIELD
#define MAC_ERP_NON_ERP_PRESENT                 CO_BIT(0)
#define MAC_ERP_USE_PROTECTION                  CO_BIT(1)
#define MAC_ERP_BARKER_PREAMBLE_MODE            CO_BIT(2)
#define MAC_ERP_IE_PRESENT                      CO_BIT(7)   // not standard, used internally

// RSN INFORMATION FIELD (WPA Extention)
#define MAC_RSNIE_ID_OFT                         0
#define MAC_RSNIE_LEN_OFT                        1
#define MAC_RSNIE_INFO_OFT                       2
#define MAC_RSNIE_VERSION_OFT                    2
#define MAC_RSNIE_GROUP_CIPHER_OFT               4
#define MAC_RSNIE_PAIRWISE_CIPHER_SUITE_CNT_OFT  8
#define MAC_RSNIE_PAIRWISE_CIPHER_SUITE_LIST_OFT 10
#define MAC_RSNIE_KEY_MANAGEMENT_SUITE_CNT_OFT   14
#define MAC_RSNIE_KEY_MANAGEMENT_SUITE_LIST_OFT  16
#define MAC_RSNIE_RSN_CAPABILITIES_OFT           20
#define MAC_RSNIE_RSN_PMKID_COUNT_OFT            22
#define MAC_RSNIE_RSN_PMKID_COUNT_LIST_OFT       24

// BSS Load IE
#define MAC_BSS_LOAD_ID_OFT                     0
#define MAC_BSS_LOAD_LEN_OFT                    1
#define MAC_BSS_LOAD_STA_CNT_OFT                2
#define MAC_BSS_LOAD_CH_UTILIZATION_OFT         4
#define MAC_BSS_LOAD_AVAIL_ADM_CAPA             5
#define MAC_BSS_LOAD_LEN                        7

// EDCA Parameter Set IE
#define MAC_EDCA_PARAM_ID_OFT                   0
#define MAC_EDCA_PARAM_LEN_OFT                  1
#define MAC_EDCA_PARAM_QOS_INFO_OFT             2
#define MAC_EDCA_PARAM_RESERVED_OFT             3
#define MAC_EDCA_PARAM_BE_PARAM_OFT             4
#define MAC_EDCA_PARAM_BK_PARAM_OFT             8
#define MAC_EDCA_PARAM_VI_PARAM_OFT             12
#define MAC_EDCA_PARAM_VO_PARAM_OFT             16
#define MAC_EDCA_PARAM_LEN                      20

// QoS Capability IE
#define MAC_QOS_CAPA_ID_OFT                     0
#define MAC_QOS_CAPA_LEN_OFT                    1
#define MAC_QOS_CAPA_INFO_OFT                   2
#define MAC_QOS_CAPA_LEN                        3

// HT Capability IE
#define MAC_HT_CAPA_ID_OFT                      0
#define MAC_HT_CAPA_LEN_OFT                     1
#define MAC_HT_CAPA_INFO_OFT                    2
#define MAC_HT_CAPA_AMPDU_PARAM_OFT             4
#define MAC_HT_CAPA_SUPPORTED_MCS_SET_OFT       5
#define MAC_HT_CAPA_EXTENDED_CAPA_OFT           21
#define MAC_HT_CAPA_TX_BEAM_FORMING_CAPA_OFT    23
#define MAC_HT_CAPA_ASEL_CAPA_OFT               27
#define MAC_HT_CAPA_ELMT_LEN                    26
#define MAC_HT_CAPA_ELMT_LEN_WD                (CO_ALIGN4_HI(MAC_HT_CAPA_ELMT_LEN) / 4)
#define MAC_HT_CAPA_LEN                         28

// HT Operation IE
#define MAC_HT_OPER_ID_OFT                      0
#define MAC_HT_OPER_LEN_OFT                     1
#define MAC_HT_OPER_PRIM_CH_OFT                 2
#define MAC_HT_OPER_INFO_OFT                    3
#define MAC_HT_OPER_INFO_SUBSET2_OFT            4
#define MAC_HT_OPER_OP_MODE_MASK                0x0003
#define MAC_HT_OPER_NONGF_MASK                  0x0004
#define MAC_HT_OPER_OBSS_MASK                   0x0010
#define MAC_HT_OPER_INFO_SUBSET3_OFT            6
#define MAC_HT_OPER_BASIC_MSC_SET_OFT           8
#define MAC_HT_OPER_ELMT_LEN                    22
#define MAC_HT_OPER_LEN                         24

// HT Protection values
enum mac_ht_oper_prot_val
{
    MAC_HT_OPER_PROT_NO_PROT   = 0,
    MAC_HT_OPER_PROT_NONMEMBER,
    MAC_HT_OPER_PROT_20MHZ,
    MAC_HT_OPER_PROP_NON_HT_MIXED
};

